Revit 2024 API
ThinLinesOptions Class
 A utility class containing setting related to the Thin Lines option which affects the display in the UI.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public class ThinLinesOptions : IDisposable
Visual Basic
Public Class ThinLinesOptions _
	Implements IDisposable
Visual C++
public ref class ThinLinesOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ThinLinesOptions
See Also
ThinLinesOptions Members
Autodesk.Revit.UI Namespace